src_Extension/Reports/ПотребностьДеталейБезЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПотребностьДеталейБезЗаказа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурснаяСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src_Extension/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src_Extension/Enums/СпособыПолученияМатериаловВСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыПолученияМатериаловВСпецификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обеспечивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизвестиПоСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизводитсяНаЭтапе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Enums/СтатусыЭтаповПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЭтаповПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_Extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>15</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_Extension/Catalogs/ЭтапыПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЭтапыПроизводства</Name>
			<Owners>
				<xr:Item>Catalog.РесурсныеСпецификации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСледующегоЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизводствоНаСтороне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УслугиПереработчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяКалькуляции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_Extension/Reports/ПотребностьДеталейБезЗаказа/Ext/ObjectModule.bsl
&НаСервере
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Инициализация переменных параметров
	Номенклатура = Неопределено;
	РесурснаяСпецификация = Неопределено;
	Количество = 1;
	
	// Получение параметра Номенклатура
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Номенклатура");
	НайденныйПараметр = Неопределено;
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование Тогда
		Номенклатура = НайденныйПараметр.Значение;
	КонецЕсли;
	
	// Получение параметра РесурснаяСпецификация
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РесурснаяСпецификация");
	НайденныйПараметр = Неопределено;
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование Тогда
		РесурснаяСпецификация = НайденныйПараметр.Значение;
	КонецЕсли;
	
	// Получение параметра Количество
	НайденныйПараметрВарианта = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Количество");
	НайденныйПараметр = Неопределено;
	Если НайденныйПараметрВарианта <> Неопределено Тогда
		НайденныйПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(НайденныйПараметрВарианта.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	Если НайденныйПараметр <> Неопределено И НайденныйПараметр.Использование Тогда
		Количество = НайденныйПараметр.Значение;
		Если НЕ ЗначениеЗаполнено(Количество) ИЛИ Количество <= 0 Тогда
			Количество = 1;
		КонецЕсли;
	КонецЕсли;
	
	// Если выбрана номенклатура, но не выбрана спецификация - подбираем приоритетную на сегодня
	Если ЗначениеЗаполнено(Номенклатура) И НЕ ЗначениеЗаполнено(РесурснаяСпецификация) Тогда
		РесурснаяСпецификация = Расш1_ОбщийМодуль1.ПриоритетнаяСпецификация(Номенклатура, ТекущаяДатаСеанса());
	КонецЕсли;

	
	Попытка 
		
		ТаблицаДеталей = ТаблицаДляПотребностиДеталей(Номенклатура, РесурснаяСпецификация, Количество);
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("ТаблицаДеталей", ТаблицаДеталей);
		
		Настройки = КомпоновщикНастроек.Настройки;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	Исключение
		Сообщить("Ошибка получения данных: " + ОписаниеОшибки());
	КонецПопытки;	

КонецПроцедуры

// Получает последний этап спецификации (где НомерСледующегоЭтапа = 0) и его подразделение
Функция ПолучитьПоследнийЭтапИПодразделение(Спецификация)
	
	Результат = Новый Структура("Этап, Подразделение");
	Результат.Вставить("Этап", Неопределено);
	Результат.Вставить("Подразделение", Неопределено);
	
	Если НЕ ЗначениеЗаполнено(Спецификация) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыПроизводства.Ссылка КАК Этап,
	|	ЭтапыПроизводства.Подразделение КАК Подразделение
	|ИЗ
	|	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	|ГДЕ
	|	ЭтапыПроизводства.Владелец = &Спецификация
	|	И НЕ ЭтапыПроизводства.ПометкаУдаления
	|	И ЭтапыПроизводства.НомерСледующегоЭтапа = 0
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапыПроизводства.НомерЭтапа УБЫВ";
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Этап = Выборка.Этап;
		Результат.Подразделение = Выборка.Подразделение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Рекурсивная функция для обхода спецификации и сбора потребности в деталях
Функция ТаблицаПотребностиДеталейПоСпецификации(Спецификация, КоличествоИзделий, Изделие, ПутьСпецификаций = Неопределено, Дата = Неопределено)
	
	Если ПутьСпецификаций = Неопределено Тогда
		ПутьСпецификаций = Новый Массив;
	КонецЕсли;
	
	ТаблицаПотребности = Новый ТаблицаЗначений;
	ТаблицаПотребности.Колонки.Добавить("Номенклатура");
	ТаблицаПотребности.Колонки.Добавить("Характеристика");
	ТаблицаПотребности.Колонки.Добавить("Упаковка");
	ТаблицаПотребности.Колонки.Добавить("КоличествоУпаковок");
	ТаблицаПотребности.Колонки.Добавить("Изделие");
	
	Если НЕ ЗначениеЗаполнено(Спецификация) Тогда
		Возврат ТаблицаПотребности;
	КонецЕсли;
	
	// Проверка на циклическую ссылку
	Если ПутьСпецификаций.Найти(Спецификация) <> Неопределено Тогда
		ТекстПути = "";
		Для Каждого ЭлементПути Из ПутьСпецификаций Цикл
			Если ТекстПути <> "" Тогда
				ТекстПути = ТекстПути + " -> ";
			КонецЕсли;
			ТекстПути = ТекстПути + Строка(ЭлементПути);
		КонецЦикла;
		ТекстПути = ТекстПути + " -> " + Строка(Спецификация);
		Сообщить("Обнаружена циклическая ссылка! Спецификация " + Строка(Спецификация) + " уже встречалась в пути: " + ТекстПути);
		Возврат ТаблицаПотребности;
	КонецЕсли;
	
	// Добавляем текущую спецификацию в путь
	ПутьСпецификаций.Добавить(Спецификация);
	
	// Получаем ОсновноеИзделиеКоличествоУпаковок из спецификации
	ЗапросСпецификации = Новый Запрос;
	ЗапросСпецификации.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РесурсныеСпецификации.ОсновноеИзделиеКоличествоУпаковок КАК ОсновноеИзделиеКоличествоУпаковок
	|ИЗ
	|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	|ГДЕ
	|	РесурсныеСпецификации.Ссылка = &Спецификация";
	
	ЗапросСпецификации.УстановитьПараметр("Спецификация", Спецификация);
	РезультатСпецификации = ЗапросСпецификации.Выполнить();
	ВыборкаСпецификации = РезультатСпецификации.Выбрать();
	
	ОсновноеИзделиеКоличествоУпаковок = 1;
	Если ВыборкаСпецификации.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаСпецификации.ОсновноеИзделиеКоличествоУпаковок) Тогда
			ОсновноеИзделиеКоличествоУпаковок = ВыборкаСпецификации.ОсновноеИзделиеКоличествоУпаковок;
		КонецЕсли;
	КонецЕсли;
	
	// Получаем материалы из ТЧ МатериалыИУслуги
	СпособПолученияПроизводитсяНаЭтапе = Перечисления.СпособыПолученияМатериаловВСпецификации.ПроизводитсяНаЭтапе;
	
	ЗапросМатериалов = Новый Запрос;
	ЗапросМатериалов.Текст = 
	"ВЫБРАТЬ
	|	МатериалыИУслуги.Номенклатура КАК Номенклатура,
	|	МатериалыИУслуги.Характеристика КАК Характеристика,
	|	МатериалыИУслуги.Упаковка КАК Упаковка,
	|	МатериалыИУслуги.КоличествоУпаковок КАК КоличествоУпаковок,
	|	МатериалыИУслуги.АлгоритмРасчетаКоличества КАК АлгоритмРасчетаКоличества,
	|	МатериалыИУслуги.СпособПолученияМатериала КАК СпособПолученияМатериала,
	|	ВЫРАЗИТЬ(МатериалыИУслуги.ИсточникПолученияПолуфабриката КАК Справочник.РесурсныеСпецификации).Ссылка КАК ИсточникПолученияПолуфабрикатаСсылка
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК МатериалыИУслуги
	|ГДЕ
	|	МатериалыИУслуги.Ссылка = &Спецификация
	|	И МатериалыИУслуги.СпособПолученияМатериала <> &СпособПолученияПроизводитсяНаЭтапе";
	
	ЗапросМатериалов.УстановитьПараметр("Спецификация", Спецификация);
	ЗапросМатериалов.УстановитьПараметр("СпособПолученияПроизводитсяНаЭтапе", СпособПолученияПроизводитсяНаЭтапе);
	
	ВыборкаМатериалов = ЗапросМатериалов.Выполнить().Выбрать();
	
	Пока ВыборкаМатериалов.Следующий() Цикл
				
		// Применяем алгоритм расчета количества, если он есть
		Если ЗначениеЗаполнено(ВыборкаМатериалов.АлгоритмРасчетаКоличества) И ВыборкаМатериалов.АлгоритмРасчетаКоличества <> "" Тогда
			КоличествоМатериала = Расш1_ОбщийМодульКалькуляция.ВычислитьАлгоритмРасчетаКоличества(ВыборкаМатериалов.АлгоритмРасчетаКоличества, КоличествоИзделий);  
		Иначе
			//КоличествоИзделийДляАлгоритма = КоличествоИзделий; 
			КоличествоМатериала = ВыборкаМатериалов.КоличествоУпаковок / ОсновноеИзделиеКоличествоУпаковок * КоличествоИзделий;  
		КонецЕсли;
		
		
		// Обрабатываем материал
		Если ЗначениеЗаполнено(ВыборкаМатериалов.ИсточникПолученияПолуфабрикатаСсылка) Тогда
			// Если указан источник получения полуфабриката - вызываем рекурсию
			ТаблицаПодчиненных = ТаблицаПотребностиДеталейПоСпецификации(ВыборкаМатериалов.ИсточникПолученияПолуфабрикатаСсылка, КоличествоМатериала, Изделие, ПутьСпецификаций, Дата);
			Если ТаблицаПодчиненных.Количество() > 0 Тогда
				Для Каждого Строка Из ТаблицаПодчиненных Цикл
					ЗаполнитьЗначенияСвойств(ТаблицаПотребности.Добавить(), Строка);
				КонецЦикла;
			КонецЕсли;
		Иначе
			// Получаем приоритетную спецификацию для материала
			СпецификацияМатериала = Расш1_ОбщийМодуль1.ПриоритетнаяСпецификация(ВыборкаМатериалов.Номенклатура, Дата);
			
			Если ЗначениеЗаполнено(СпецификацияМатериала) Тогда
				// Получаем последний этап спецификации и его подразделение
				СтруктураЭтапа = ПолучитьПоследнийЭтапИПодразделение(СпецификацияМатериала);
				
				Если ЗначениеЗаполнено(СтруктураЭтапа.Подразделение) Тогда
					// Получаем родителя подразделения
					ЗапросПодразделения = Новый Запрос;
					ЗапросПодразделения.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	СтруктураПредприятия.Родитель КАК Родитель
					|ИЗ
					|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
					|ГДЕ
					|	СтруктураПредприятия.Ссылка = &Подразделение";
					
					ЗапросПодразделения.УстановитьПараметр("Подразделение", СтруктураЭтапа.Подразделение);
					РезультатПодразделения = ЗапросПодразделения.Выполнить();
					ВыборкаПодразделения = РезультатПодразделения.Выбрать();
					
					РодительПодразделения = Неопределено;
					Если ВыборкаПодразделения.Следующий() Тогда
						РодительПодразделения = ВыборкаПодразделения.Родитель;
					КонецЕсли;
					
					// Ищем подразделение "14 цех (сборочный)"
					ЦехСборочный = Справочники.СтруктураПредприятия.НайтиПоНаименованию("14 цех (сборочный)", Истина);
					
					Если ЗначениеЗаполнено(ЦехСборочный) И ЗначениеЗаполнено(РодительПодразделения) И РодительПодразделения = ЦехСборочный Тогда
						// Если родитель = "14 цех (сборочный)" - вызываем рекурсию
						ТаблицаПодчиненных = ТаблицаПотребностиДеталейПоСпецификации(СпецификацияМатериала, КоличествоМатериала, Изделие, ПутьСпецификаций, Дата);
						Если ТаблицаПодчиненных.Количество() > 0 Тогда
							Для Каждого Строка Из ТаблицаПодчиненных Цикл
								ЗаполнитьЗначенияСвойств(ТаблицаПотребности.Добавить(), Строка);
							КонецЦикла;
						КонецЕсли;
					Иначе
						// Если родитель НЕ равен "14 цех (сборочный)" - добавляем материал в таблицу
						НоваяСтрока = ТаблицаПотребности.Добавить();
						НоваяСтрока.Номенклатура = ВыборкаМатериалов.Номенклатура;
						НоваяСтрока.Характеристика = ВыборкаМатериалов.Характеристика;
						НоваяСтрока.Упаковка = ВыборкаМатериалов.Упаковка;
						НоваяСтрока.КоличествоУпаковок = КоличествоМатериала;
						НоваяСтрока.Изделие = Изделие;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			// Если спецификация не найдена - ничего не делаем (это уже материал)
		КонецЕсли;
		
	КонецЦикла;
	
	// Удаляем текущую спецификацию из пути при выходе
	Индекс = ПутьСпецификаций.Найти(Спецификация);
	Если Индекс <> Неопределено Тогда
		ПутьСпецификаций.Удалить(Индекс);
	КонецЕсли;
	
	Возврат ТаблицаПотребности;
	
КонецФункции

//Использование
//Отчет "Потребность деталей без заказа"    
//Эта функция возвращает таблицу для потребности деталей, состоящую из:
//Деталь - номенклатура детали, 
//КоличествоУпаковокТребуется - количество деталей, требуемое для производства выбранного изделия,
//КоличествоУпаковокВНаличииДК - количество деталей, которое есть в наличии на складе "ДК", 
//КоличествоУпаковокВНаличииЦех - количество деталей, которое есть в наличии в цеховой кладовой подразделения,
//КоличествоУпаковокОжидается - количество деталей, которое уже заказано в заказах на производство деталей,
//ЗаказНаПроизводство - пустое (для совместимости),
//Изделие - выбранное изделие,
//КоличествоУпаковокДефицит - разница КоличествоУпаковокТребуется - КоличествоУпаковокВНаличииДК - КоличествоУпаковокВНаличииЦех - КоличествоУпаковокОжидается,
//параметры:
//Номенклатура, РесурснаяСпецификация, Количество.
Функция ТаблицаДляПотребностиДеталей(Номенклатура=Неопределено, РесурснаяСпецификация=Неопределено, Количество=1)
	
	// Обработка параметров
	Если НЕ ЗначениеЗаполнено(Номенклатура) ИЛИ НЕ ЗначениеЗаполнено(РесурснаяСпецификация) Тогда
		// Возвращаем пустую таблицу, если не указаны обязательные параметры
		ТаблицаРезультат = Новый ТаблицаЗначений;
		ТаблицаРезультат.Колонки.Добавить("Деталь");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокТребуется");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокВНаличииДК");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокВНаличииЦех");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокОжидается");
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаПроизводство");
		ТаблицаРезультат.Колонки.Добавить("Изделие");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокДефицит");
		Возврат ТаблицаРезультат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Количество) ИЛИ Количество <= 0 Тогда
		Количество = 1;
	КонецЕсли;
	
	// Используем текущую дату для получения приоритетной спецификации и остатков
	Дата = ТекущаяДатаСеанса();
	
	// Получаем потребность в деталях рекурсивным обходом спецификации
	// Функция сама получает ОсновноеИзделиеКоличествоУпаковок из спецификации
	// и пересчитывает количество материалов: (КоличествоУпаковокИзСпецификации / ОсновноеИзделиеКоличествоУпаковок) * Количество
	
	ТаблицаПотребности = ТаблицаПотребностиДеталейПоСпецификации(РесурснаяСпецификация, Количество, Номенклатура, Неопределено, Дата);
	
	Если ТаблицаПотребности.Количество() = 0 Тогда
		// Возвращаем пустую таблицу с нужными колонками
		ТаблицаРезультат = Новый ТаблицаЗначений;
		ТаблицаРезультат.Колонки.Добавить("Деталь");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокТребуется");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокВНаличииДК");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокВНаличииЦех");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокОжидается");
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаПроизводство");
		ТаблицаРезультат.Колонки.Добавить("Изделие");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокДефицит");
		Возврат ТаблицаРезультат;
	КонецЕсли;
	
	// Группируем потребность по номенклатуре
	ТаблицаПотребностиСгруппированная = Новый ТаблицаЗначений;
	ТаблицаПотребностиСгруппированная.Колонки.Добавить("Номенклатура");
	ТаблицаПотребностиСгруппированная.Колонки.Добавить("КоличествоУпаковокТребуется");
	ТаблицаПотребностиСгруппированная.Колонки.Добавить("Изделие");
	
	Для Каждого Строка Из ТаблицаПотребности Цикл
		Критерий = Новый Структура("Номенклатура, Изделие", Строка.Номенклатура, Строка.Изделие);
		НайденныеСтроки = ТаблицаПотребностиСгруппированная.НайтиСтроки(Критерий);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаПотребностиСгруппированная.Добавить();
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.КоличествоУпаковокТребуется = Строка.КоличествоУпаковок;
			НоваяСтрока.Изделие = Строка.Изделие;
		Иначе
			НайденнаяСтрока = НайденныеСтроки[0];
			НайденнаяСтрока.КоличествоУпаковокТребуется = НайденнаяСтрока.КоличествоУпаковокТребуется + Строка.КоличествоУпаковок;
		КонецЕсли;
	КонецЦикла;

	// Подготовка списка номенклатур для запросов остатков
	МассивНоменклатур = ТаблицаПотребностиСгруппированная.ВыгрузитьКолонку("Номенклатура");
	
	Если МассивНоменклатур.Количество() = 0 Тогда
		ТаблицаРезультат = Новый ТаблицаЗначений;
		ТаблицаРезультат.Колонки.Добавить("Деталь");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокТребуется");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокВНаличииДК");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокВНаличииЦех");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокОжидается");
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаПроизводство");
		ТаблицаРезультат.Колонки.Добавить("Изделие");
		ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокДефицит");
		Возврат ТаблицаРезультат;
	КонецЕсли;
	
	// Запрос для получения остатков и ожидаемых поступлений
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	// Создаем запрос для получения остатков и ожидаемых поступлений
	// Используем оператор В() с массивом напрямую
	Запрос.Текст = 
	"// ШАГ 1: Подготовка списка складов ДК для запроса остатков
	|ВЫБРАТЬ
	|	СкладДК.Ссылка КАК Склад
	|ПОМЕСТИТЬ ВТСкладыДК
	|ИЗ
	|	Справочник.Склады КАК СкладДК
	|ГДЕ
	|	СкладДК.Наименование = &СкладДКНаименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// ШАГ 2: Получение остатков деталей на складе ДК
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|		КОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток < 0
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ) КАК КоличествоУпаковокВНаличииДК
	|ПОМЕСТИТЬ ВТОстаткиДК
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаКон,
	|			Склад В (ВЫБРАТЬ ВТСкладыДК.Склад ИЗ ВТСкладыДК КАК ВТСкладыДК)
	|				И Номенклатура В(&МассивНоменклатур)
	|				И Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// ШАГ 3: Подготовка списка цеховых складов с подразделениями
	|ВЫБРАТЬ
	|	СкладЦех.Ссылка КАК Склад,
	|	СкладЦех.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТСкладыЦех
	|ИЗ
	|	Справочник.Склады КАК СкладЦех
	|ГДЕ
	|	СкладЦех.ЦеховаяКладовая = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// ШАГ 4: Получение остатков деталей на цеховых складах подразделений
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ВТСкладыЦех.Подразделение КАК Подразделение,
	|	СУММА(ВЫБОР
	|		КОГДА ТоварыНаСкладахОстатки.ВНаличииОстаток < 0
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ) КАК КоличествоУпаковокВНаличииЦех
	|ПОМЕСТИТЬ ВТОстаткиЦех
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаКон,
	|			Склад В (ВЫБРАТЬ ВТСкладыЦех.Склад ИЗ ВТСкладыЦех КАК ВТСкладыЦех)
	|				И Номенклатура В(&МассивНоменклатур)
	|				И Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК ТоварыНаСкладахОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСкладыЦех КАК ВТСкладыЦех
	|		ПО ТоварыНаСкладахОстатки.Склад = ВТСкладыЦех.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.Склад,
	|	ВТСкладыЦех.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// ШАГ 5: Выбор этапов производства для расчета ожидаемого количества деталей
	|ВЫБРАТЬ
	|	Этапы.Ссылка КАК ЭтапПроизводства,
	|	Этапы.Распоряжение КАК ЗаказНаПроизводство
	|ПОМЕСТИТЬ ВТЗаказыДляОтбора
	|ИЗ
	|	Документ.ЭтапПроизводства2_2 КАК Этапы
	|ГДЕ
	|	Этапы.Статус В(&Статусы)
	|	И Этапы.КоличествоУпаковокПлан - Этапы.КоличествоУпаковокФакт - Этапы.КоличествоУпаковокОтменено > 0
	|	И НЕ Этапы.Распоряжение ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// ШАГ 6: Расчет ожидаемого количества деталей из этапов производства деталей
	|ВЫБРАТЬ
	|	ВыходныеИзделия.Номенклатура КАК Номенклатура,
	|	СУММА(ВыходныеИзделия.КоличествоУпаковок) КАК КоличествоУпаковокОжидается
	|ПОМЕСТИТЬ ВТЗаказыДеталей
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ВыходныеИзделия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыДляОтбора КАК ВТЗаказыДляОтбора
	|		ПО ВыходныеИзделия.Ссылка = ВТЗаказыДляОтбора.ЭтапПроизводства
	|ГДЕ
	|	НЕ ВыходныеИзделия.Отменено
	|	И ВыходныеИзделия.Номенклатура В(&МассивНоменклатур)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыходныеИзделия.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// ШАГ 7: Финальный запрос - объединение всех данных
	|// ВАЖНО: В этом отчете мы не используем временную таблицу для потребности,
	|// а объединяем результаты вручную после выполнения запроса
	|// Получаем остатки и ожидаемые поступления для всех номенклатур из потребности
	|// Используем UNION для объединения всех номенклатур из разных источников
	|ВЫБРАТЬ
	|	ВТОстаткиДК.Номенклатура КАК Номенклатура,
	|	ВТОстаткиДК.КоличествоУпаковокВНаличииДК КАК КоличествоУпаковокВНаличииДК,
	|	ЕСТЬNULL(ВТОстаткиЦех.КоличествоУпаковокВНаличииЦех, 0) КАК КоличествоУпаковокВНаличииЦех,
	|	ЕСТЬNULL(ВТЗаказыДеталей.КоличествоУпаковокОжидается, 0) КАК КоличествоУпаковокОжидается
	|ИЗ
	|	ВТОстаткиДК КАК ВТОстаткиДК
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиЦех КАК ВТОстаткиЦех
	|		ПО ВТОстаткиДК.Номенклатура = ВТОстаткиЦех.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыДеталей КАК ВТЗаказыДеталей
	|		ПО ВТОстаткиДК.Номенклатура = ВТЗаказыДеталей.Номенклатура";
	
	// Установка параметров для запроса
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению);
	МассивСтатусов.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Начат);
	Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СкладДКНаименование", "Детальная кладовая");
	Запрос.УстановитьПараметр("МассивНоменклатур", МассивНоменклатур);
	
	// Выполняем запрос для получения остатков и ожидаемых поступлений
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	// Создаем соответствие для быстрого поиска остатков по номенклатуре
	// Суммируем остатки на цеховых складах по всем подразделениям для каждой номенклатуры
	СоответствиеОстатков = Новый Соответствие;
	Для Каждого Строка Из ТаблицаОстатков Цикл
		Если СоответствиеОстатков.Получить(Строка.Номенклатура) = Неопределено Тогда
			СтруктураОстатков = Новый Структура;
			СтруктураОстатков.Вставить("КоличествоУпаковокВНаличииДК", 0);
			СтруктураОстатков.Вставить("КоличествоУпаковокВНаличииЦех", 0);
			СтруктураОстатков.Вставить("КоличествоУпаковокОжидается", 0);
			СоответствиеОстатков.Вставить(Строка.Номенклатура, СтруктураОстатков);
		КонецЕсли;
		СтруктураОстатков = СоответствиеОстатков.Получить(Строка.Номенклатура);
		СтруктураОстатков.КоличествоУпаковокВНаличииДК = СтруктураОстатков.КоличествоУпаковокВНаличииДК + Строка.КоличествоУпаковокВНаличииДК;
		СтруктураОстатков.КоличествоУпаковокВНаличииЦех = СтруктураОстатков.КоличествоУпаковокВНаличииЦех + Строка.КоличествоУпаковокВНаличииЦех;
		СтруктураОстатков.КоличествоУпаковокОжидается = СтруктураОстатков.КоличествоУпаковокОжидается + Строка.КоличествоУпаковокОжидается;
	КонецЦикла;
	
	// Формируем итоговую таблицу, объединяя потребность с остатками
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Деталь");
	ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокТребуется");
	ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокВНаличииДК");
	ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокВНаличииЦех");
	ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокОжидается");
	ТаблицаРезультат.Колонки.Добавить("ЗаказНаПроизводство");
	ТаблицаРезультат.Колонки.Добавить("Изделие");
	ТаблицаРезультат.Колонки.Добавить("КоличествоУпаковокДефицит");
	
	// Группируем потребность по номенклатуре для итоговой таблицы
	СоответствиеПотребности = Новый Соответствие;
	Для Каждого Строка Из ТаблицаПотребностиСгруппированная Цикл
		Если СоответствиеПотребности.Получить(Строка.Номенклатура) = Неопределено Тогда
			СтруктураПотребности = Новый Структура;
			СтруктураПотребности.Вставить("КоличествоУпаковокТребуется", 0);
			СтруктураПотребности.Вставить("Изделие", Строка.Изделие);
			СоответствиеПотребности.Вставить(Строка.Номенклатура, СтруктураПотребности);
		КонецЕсли;
		СтруктураПотребности = СоответствиеПотребности.Получить(Строка.Номенклатура);
		СтруктураПотребности.КоличествоУпаковокТребуется = СтруктураПотребности.КоличествоУпаковокТребуется + Строка.КоличествоУпаковокТребуется;
	КонецЦикла;
	
	// Формируем итоговую таблицу
	Для Каждого КлючЗначение Из СоответствиеПотребности Цикл
		НоменклатураДетали = КлючЗначение.Ключ;
		СтруктураПотребности = КлючЗначение.Значение;
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		НоваяСтрока.Деталь = НоменклатураДетали;
		НоваяСтрока.КоличествоУпаковокТребуется = СтруктураПотребности.КоличествоУпаковокТребуется;
		НоваяСтрока.Изделие = СтруктураПотребности.Изделие;
		НоваяСтрока.ЗаказНаПроизводство = Документы.ЗаказНаПроизводство2_2.ПустаяСсылка();
		
		// Получаем остатки и ожидаемые поступления
		СтруктураОстатков = СоответствиеОстатков.Получить(НоменклатураДетали);
		Если СтруктураОстатков <> Неопределено Тогда
			НоваяСтрока.КоличествоУпаковокВНаличииДК = СтруктураОстатков.КоличествоУпаковокВНаличииДК;
			НоваяСтрока.КоличествоУпаковокВНаличииЦех = СтруктураОстатков.КоличествоУпаковокВНаличииЦех;
			НоваяСтрока.КоличествоУпаковокОжидается = СтруктураОстатков.КоличествоУпаковокОжидается;
		Иначе
			НоваяСтрока.КоличествоУпаковокВНаличииДК = 0;
			НоваяСтрока.КоличествоУпаковокВНаличииЦех = 0;
			НоваяСтрока.КоличествоУпаковокОжидается = 0;
		КонецЕсли;
		
		// Рассчитываем дефицит
		НоваяСтрока.КоличествоУпаковокДефицит = НоваяСтрока.КоличествоУпаковокТребуется 
			- НоваяСтрока.КоличествоУпаковокВНаличииДК 
			- НоваяСтрока.КоличествоУпаковокВНаличииЦех; 
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции
